<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"b9ce4f427f4d75dc77db47c7beb4088559c372e47f032e2624cfed8a6e6ac847","plan_job_ref":"Job Pull Request Checks #4741 at https://github.com/GSA-TTS/FAC/actions/runs/14649405442","plan_out_hash":"2ca999381a56f9040d07b4fd375cb815e9746d507459c9929fcd2580353c8420","plan_hash":"105b3afc6f5acabd468e9af5cf13fc1005593a008c1ad1d108e7dc65621006ba","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 6 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2025-04-21T20:53:40Z" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      instances                   = 4 -> 2
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "postgrest"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-production-postgrest.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2025-04-21T20:53:48Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "41e96938-1383-c2ce-3157-af85063feaa3"

-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873"
        }

#        (1 unchanged block hidden)
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "bffa4f44-73e2-295d-6c7e-2809a21406d6"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
        }
+       policy {
+           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }

#        (1 unchanged block hidden)
    }

  # module.production.cloudfoundry_route.postgrest will be updated in-place
!~  resource "cloudfoundry_route" "postgrest" {
!~      destinations = [
-           {
-               app_id           = "4a9acf70-4f31-482b-8661-54ba4b5f7945" -> null
-               app_process_type = "web" -> null
-               id               = "632bd828-cee5-49a3-8a0e-546b0067cf5b" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "23442b6c-89d1-4d9c-b343-4a7e7145b545"
!~      updated_at   = "2025-04-21T20:53:48Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      instances                       = 3 -> 2
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-21T20:54:31Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-24T16:05:03Z" -> (known after apply)
        }
    }

  # module.production.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-               app_process_type = "web" -> null
-               id               = "68e16414-09a5-4efc-b00a-6ec2344161a2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "5ae55cd7-5641-4974-a489-56a5cf2c7524"
!~      updated_at   = "2025-04-21T20:54:32Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4741](https://github.com/GSA-TTS/FAC/actions/runs/14649405442)